windowsair/wireless-esp8266-dap/components/DAP/config/DAP_config.h
/// SWO Streaming Trace.
#define SWO_STREAM SWO_FUNCTION_ENABLE ///< SWO Streaming Trace: 1 = available, 0 = not available.

/// Clock frequency of the Test Domain Timer. Timer value is returned with \ref TIMESTAMP_GET.
#define TIMESTAMP_CLOCK 5000000U ///< Timestamp clock in Hz (0 = timestamps not supported).
// <<<<<<<<<<<<<<<<<<<<<5MHz

/// Indicate that UART Communication Port is available.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
#define DAP_UART                0               ///< DAP UART:  1 = available, 0 = not available.

/// USART Driver instance number for the UART Communication Port.
#define DAP_UART_DRIVER         1               ///< USART Driver instance number (Driver_USART#).

/// UART Receive Buffer Size.
#define DAP_UART_RX_BUFFER_SIZE 1024U           ///< Uart Receive Buffer Size in bytes (must be 2^n).

/// UART Transmit Buffer Size.
#define DAP_UART_TX_BUFFER_SIZE 1024U           ///< Uart Transmit Buffer Size in bytes (must be 2^n).

/// Indicate that UART Communication via USB COM Port is available.
/// This information is returned by the command \ref DAP_Info as part of <b>Capabilities</b>.
#define DAP_UART_USB_COM_PORT   0               ///< USB COM Port:  1 = available, 0 = not available.

/// Debug Unit is connected to fixed Target Device.
/// The Debug Unit may be part of an evaluation board and always connected to a fixed
/// known device. In this case a Device Vendor, Device Name, Board Vendor and Board Name strings
/// are stored and may be used by the debugger or IDE to configure device parameters.
#define TARGET_FIXED            1               ///< Target: 1 = known, 0 = unknown;

#define TARGET_DEVICE_VENDOR    ""                 ///< String indicating the Silicon Vendor
#define TARGET_DEVICE_NAME      ""                 ///< String indicating the Target Device
#define TARGET_BOARD_VENDOR     "windowsair"       ///< String indicating the Board Vendor
#define TARGET_BOARD_NAME       "ESP wireless DAP" ///< String indicating the Board Name

#if TARGET_FIXED != 0
#include <string.h>
static const char TargetDeviceVendor [] = TARGET_DEVICE_VENDOR;
static const char TargetDeviceName   [] = TARGET_DEVICE_NAME;
static const char TargetBoardVendor  [] = TARGET_BOARD_VENDOR;
static const char TargetBoardName    [] = TARGET_BOARD_NAME;
#endif

#define osDelay(n) dap_os_delay(n)

/**
 * @brief Get Vendor ID string.
 *
 * @param str Pointer to buffer to store the string (max 60 characters).
 * @return String length. (including terminating NULL character) or 0 (no string).
 */
__STATIC_INLINE uint8_t DAP_GetVendorString(char *str)
{
  // In fact, Keil can get the corresponding information through USB
  // without filling in this information.
  // (void)str;
  strcpy(str, "windowsair");
  return (sizeof("windowsair"));
}

/**
 * @brief Get Product ID string.
 *
 * @param str Pointer to buffer to store the string (max 60 characters).
 * @return String length. (including terminating NULL character) or 0 (no string).
 */
__STATIC_INLINE uint8_t DAP_GetProductString(char *str)
{
  //(void)str;
  strcpy(str, "CMSIS-DAP v2");
  return (sizeof("CMSIS-DAP v2"));
}

/**
 * @brief Get Serial Number string.
 *
 * @param str Pointer to buffer to store the string (max 60 characters).
 * @return String length. (including terminating NULL character) or 0 (no string).
 */
__STATIC_INLINE uint8_t DAP_GetSerNumString(char *str)
{
  strcpy(str, "1234");
  return (sizeof("1234"));
}

/**
 * @brief Get Target Device Vendor string.
 *
 * @param str Pointer to buffer to store the string (max 60 characters).
 * @return String length (including terminating NULL character) or 0 (no string).
 */
__STATIC_INLINE uint8_t DAP_GetTargetDeviceVendorString (char *str) {
#if TARGET_FIXED != 0
  uint8_t len;

  strcpy(str, TargetDeviceVendor);
  len = (uint8_t)(strlen(TargetDeviceVendor) + 1U);
  return (len);
#else
  (void)str;
  return (0U);
#endif
}

/**
 * @brief Get Target Device Name string.
 *
 * @param str Pointer to buffer to store the string (max 60 characters).
 * @return String length (including terminating NULL character) or 0 (no string).
 */
__STATIC_INLINE uint8_t DAP_GetTargetDeviceNameString (char *str) {
#if TARGET_FIXED != 0
  uint8_t len;

  strcpy(str, TargetDeviceName);
  len = (uint8_t)(strlen(TargetDeviceName) + 1U);
  return (len);
#else
  (void)str;
  return (0U);
#endif
}

/**
 * @brief Get Target Board Vendor string.
 *
 * @param str Pointer to buffer to store the string (max 60 characters).
 * @return String length (including terminating NULL character) or 0 (no string).
 */
__STATIC_INLINE uint8_t DAP_GetTargetBoardVendorString (char *str) {
#if TARGET_FIXED != 0
  uint8_t len;

  strcpy(str, TargetBoardVendor);
  len = (uint8_t)(strlen(TargetBoardVendor) + 1U);
  return (len);
#else
  (void)str;
  return (0U);
#endif
}

/**
 * @brief Get Target Board Name string.
 *
 * @param str Pointer to buffer to store the string (max 60 characters).
 * @return String length (including terminating NULL character) or 0 (no string).
 */
__STATIC_INLINE uint8_t DAP_GetTargetBoardNameString (char *str) {
#if TARGET_FIXED != 0
  uint8_t len;

  strcpy(str, TargetBoardName);
  len = (uint8_t)(strlen(TargetBoardName) + 1U);
  return (len);
#else
  (void)str;
  return (0U);
#endif
}

/**
 * @brief Get Product Firmware Version string.
 *
 * @param str Pointer to buffer to store the string (max 60 characters).
 * @return String length (including terminating NULL character) or 0 (no string).
 */
__STATIC_INLINE uint8_t DAP_GetProductFirmwareVersionString (char *str) {
  (void)str;
  return (0U);
}

///@}


// Note: DO NOT modify these pins: PIN_SWDIO  PIN_SWDIO_MOSI  PIN_SWCLK
// Modify the following pins carefully: PIN_TDO
#ifdef CONFIG_IDF_TARGET_ESP8266
  #define PIN_SWDIO 12      // SPI MISO
  #define PIN_SWDIO_MOSI 13 // SPI MOSI
  #define PIN_SWCLK 14
  #define PIN_TDO 16        // device TDO -> Host Data Input (use RTC pin 16)
  #define PIN_TDI 4
  #define PIN_nTRST 0       // optional
  #define PIN_nRESET 5

  #define PIN_LED_CONNECTED _ // won't be used
  #define PIN_LED_RUNNING _ // won't be used
#elif defined CONFIG_IDF_TARGET_ESP32
  #define PIN_SWDIO 12      // SPI MISO
  #define PIN_SWDIO_MOSI 13 // SPI MOSI
  #define PIN_SWCLK 14
  #define PIN_TDO 19        // device TDO -> Host Data Input
  #define PIN_TDI 18
  #define PIN_nTRST 25       // optional
  #define PIN_nRESET 26

  #define PIN_LED_CONNECTED _ // won't be used
  #define PIN_LED_RUNNING _ // won't be used
#elif defined CONFIG_IDF_TARGET_ESP32C3
  #define PIN_SWDIO _      // SPI MISO
  #define PIN_SWDIO_MOSI 7 // SPI MOSI
  #define PIN_SWCLK 6
  #define PIN_TDO 8        // device TDO -> Host Data Input
  #define PIN_TDI 9
  #define PIN_nTRST 4       // optional
  #define PIN_nRESET 5

  #define PIN_LED_CONNECTED _ // won't be used
  #define PIN_LED_RUNNING _ // won't be used
#elif defined CONFIG_IDF_TARGET_ESP32S3
  #define PIN_SWDIO _      // SPI MISO
  #define PIN_SWDIO_MOSI 11 // SPI MOSI
  #define PIN_SWCLK 12
  #define PIN_TDO 9        // device TDO -> Host Data Input
  #define PIN_TDI 10
  #define PIN_nTRST 14       // optional
  #define PIN_nRESET 13

  #define PIN_LED_CONNECTED _ // won't be used
  #define PIN_LED_RUNNING _ // won't be used
#else
#error "not a supported target"
#endif


//**************************************************************************************************
/**
\defgroup DAP_Config_PortIO_gr CMSIS-DAP Hardware I/O Pin Access
\ingroup DAP_ConfigIO_gr
@{

Standard I/O Pins of the CMSIS-DAP Hardware Debug Port support standard JTAG mode
and Serial Wire Debug (SWD) mode. In SWD mode only 2 pins are required to implement the debug
interface of a device. The following I/O Pins are provided:

